In [2]:
import pandas as pd
import numpy as np

Install Pandas

pip install pandas

Import pandas

Read the Data

File Handling

```
try:
    data = pd.read_csv('path_of_file')
except FileNotFoundError as e:
    print("File not found", e)
```

In [3]:
data = pd.read_csv('dataset_lyst1747557373435.csv')
data

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

Diplay the top 5 records in the data

In [4]:
data.head(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,0,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,0,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,1,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S
5,897,0,3,"Svensson, Mr. Johan Cervin",male,14.0,0,0,7538,9.2250,NaN,S
6,898,1,3,"Connolly, Miss. Kate",female,30.0,0,0,330972,7.6292,NaN,Q
7,899,0,2,"Caldwell, Mr. Albert Francis",male,26.0,1,1,248738,29.0000,NaN,S
8,900,1,3,"Abrahim, Mrs. Joseph (Sophie Halaut Easu)",female,18.0,0,0,2657,7.2292,NaN,C
9,901,0,3,"Davies, Mr. John Samuel",male,21.0,2,0,A/4 48871,24.1500,NaN,S
10,902,0,3,"Ilieff, Mr. Ylio",male,NaN,0,0,349220,7.8958,NaN,S
11,903,0,1,"Jones, Mr. Charles Cresson",male,46.0,0,0,694,26.0000,NaN,S
12,904,1,1,"Snyder, Mrs. John Pillsbury (Nelle Stevenson)",female,23.0,1,0,21228,82.2667,B45,S
13,905,0,2,"Howard, Mr. Benjamin",male,63.0,1,0,24065,26.0000,NaN,S
14,906,1,1,"Chaffee, Mrs. Herbert Fuller (Carrie Constance...",female,47.0,1,0,W.E.P. 5734,61.1750,E31,S

Data Structure : DataFrame

In [5]:
type(data)

pandas.core.frame.DataFrame

Display the last few records in the dataframe

In [6]:
data.tail()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [7]:
data.tail(15)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
403,1295,0,1,"Carrau, Mr. Jose Pedro",male,17.0,0,0,113059,47.1000,NaN,S
404,1296,0,1,"Frauenthal, Mr. Isaac Gerald",male,43.0,1,0,17765,27.7208,D40,C
405,1297,0,2,"Nourney, Mr. Alfred (Baron von Drachstedt"")""",male,20.0,0,0,SC/PARIS 2166,13.8625,D38,C
406,1298,0,2,"Ware, Mr. William Jeffery",male,23.0,1,0,28666,10.5000,NaN,S
407,1299,0,1,"Widener, Mr. George Dunton",male,50.0,1,1,113503,211.5000,C80,C
408,1300,1,3,"Riordan, Miss. Johanna Hannah""""",female,NaN,0,0,334915,7.7208,NaN,Q
409,1301,1,3,"Peacock, Miss. Treasteall",female,3.0,1,1,SOTON/O.Q. 3101315,13.7750,NaN,S
410,1302,1,3,"Naughton, Miss. Hannah",female,NaN,0,0,365237,7.7500,NaN,Q
411,1303,1,1,"Minahan, Mrs. William Edward (Lillian E Thorpe)",female,37.0,1,0,19928,90.0000,C78,Q
412,1304,1,3,"Henriksson, Miss. Jenny Lovisa",female,28.0,0,0,347086,7.7750,NaN,S
413,1305,0,3,"Spector, Mr. Woolf",male,NaN,0,0,A.5. 3236,8.0500,NaN,S
414,1306,1,1,"Oliva y Ocana, Dona. Fermina",female,39.0,0,0,PC 17758,108.9000,C105,C
415,1307,0,3,"Saether, Mr. Simon Sivertsen",male,38.5,0,0,SOTON/O.Q. 3101262,7.2500,NaN,S
416,1308,0,3,"Ware, Mr. Frederick",male,NaN,0,0,359309,8.0500,NaN,S
417,1309,0,3,"Peter, Master. Michael J",male,NaN,1,1,2668,22.3583,NaN,C

In [8]:
data['PassengerId']

0       892
1       893
2       894
3       895
4       896
       ...
413    1305
414    1306
415    1307
416    1308
417    1309
Name: PassengerId, Length: 418, dtype: int64

In [9]:
type(data['PassengerId'])

pandas.core.series.Series

Series in Depth: It's a one dimensional array-like structure in Pandas that can hold a sequence of vakue of any data type . Each value in a Series is linked with a associated label, known as the index. You can also customize the index labels in the series.

Create a series from scalar value with the custom index

In [10]:
series_scalar = pd.Series(10, index=['a', 'b', 'c', 'd', 'e', 'f'])
print(series_scalar)

a    10
b    10
c    10
d    10
e    10
f    10
dtype: int64

In [11]:
series_scalar['e']

np.int64(10)

In [12]:
data = [10, 20, 30, 40, 50, 60, 70]
series_list = pd.Series(data)
print(series_list)

0    10
1    20
2    30
3    40
4    50
5    60
6    70
dtype: int64

In [13]:
import numpy as np
data_array = np.array([10, 20, 30, 40, 50, 60])
series_custom_array = pd.Series(data_array, index=['a', 'b', 'c', 'd', 'e', 'f'])
print(series_custom_array)

a    10
b    20
c    30
d    40
e    50
f    60
dtype: int64

In [14]:
data_dict = {'a': 10, 'b': 20, 'c': 30}
series_dict = pd.Series(data_dict)
series_dict

a    10
b    20
c    30
dtype: int64

Slicing

In [15]:
series_dict[1:3]

b    20
c    30
dtype: int64

In [16]:
series_dict['b':'c']

b    20
c    30
dtype: int64

Attribute in Series Data Structure

In [17]:
data = ['New Delhi ', 'Washington', 'London', 'Paris']
index = ['India', 'USA', 'UK', 'France']

series_capital_country = pd.Series(data, index=index)
print(series_capital_country)

India     New Delhi
USA       Washington
UK            London
France         Paris
dtype: object

In [18]:
print("Index of the series_capital_country")
print(series_capital_country.index)

Index of the series_capital_country
Index(['India', 'USA', 'UK', 'France'], dtype='object')

In [19]:
print("Values of the series_capital_country")
print(series_capital_country.values)

Values of the series_capital_country
['New Delhi ' 'Washington' 'London' 'Paris']

Dtype is data type of each element in that type of data structure

In [20]:
print("Data type of the series_capital_country")
print(series_capital_country.dtype)

Data type of the series_capital_country
object

In [21]:
print("Shape of the series_capital_country")
print(series_capital_country.shape)

Shape of the series_capital_country
(4,)

In [22]:
print("Size of the series_capital_country")
print(series_capital_country.size)

Size of the series_capital_country
4

In [23]:
print("Is series_capital_country empty ?")
print(series_capital_country.empty)

Is series_capital_country empty ?
False

In [24]:
print("Is series_capital_country NaN?")
print(series_capital_country.hasnans)

Is series_capital_country NaN?
False

In [25]:
print("Is series_capital_country contains unique elements?")
print(series_capital_country.is_unique)

Is series_capital_country contains unique elements?
True

In [26]:
print("Dimensions of the series_capital_country")
print(series_capital_country.ndim)

Dimensions of the series_capital_country
1

In [27]:
empty_series = pd.Series()
print(empty_series)

Series([], dtype: object)

In [28]:
print("Is empty_series empty?")
print(empty_series.empty)

Is empty_series empty?
True

Methods in Series Data Structure

In [29]:
series_capital_country.head(2)

India    New Delhi
USA      Washington
dtype: object

In [30]:
series_capital_country.tail(2)

UK        London
France     Paris
dtype: object

In [31]:
marks = [85, 60, 74, 66, 89, 91]
students = ['Ram', 'Priya', 'Rashmi', 'Vidushi', 'Mohit', 'Karan']

series_students = pd.Series(marks, index=students)
print(series_students)

Ram        85
Priya      60
Rashmi     74
Vidushi    66
Mohit      89
Karan      91
dtype: int64

To get the descriptive statistics of the given data

In [32]:
series_students.describe()

count     6.000000
mean     77.500000
std      12.817956
min      60.000000
25%      68.000000
50%      79.500000
75%      88.000000
max      91.000000
dtype: float64

Value_counts()

In [33]:
series_students.value_counts()

85    1
60    1
74    1
66    1
89    1
91    1
Name: count, dtype: int64

sort_value()

In [34]:
series_students.sort_values()

Priya      60
Vidushi    66
Rashmi     74
Ram        85
Mohit      89
Karan      91
dtype: int64

drop()

In [35]:
series_students.drop('Karan')

Ram        85
Priya      60
Rashmi     74
Vidushi    66
Mohit      89
dtype: int64

In [36]:
series_students

Ram        85
Priya      60
Rashmi     74
Vidushi    66
Mohit      89
Karan      91
dtype: int64

In [37]:
series_students.drop('Karan', inplace=True)

In [38]:
series_students

Ram        85
Priya      60
Rashmi     74
Vidushi    66
Mohit      89
dtype: int64

isnull => 
detect the missing values

In [39]:
print(series_students.isnull())

Ram        False
Priya      False
Rashmi     False
Vidushi    False
Mohit      False
dtype: bool

In [40]:
print(series_students.isnull().sum())

0

In [41]:
series_students

Ram        85
Priya      60
Rashmi     74
Vidushi    66
Mohit      89
dtype: int64

In [42]:
series_students['Karan'] = 89

In [43]:
series_students

Ram        85
Priya      60
Rashmi     74
Vidushi    66
Mohit      89
Karan      89
dtype: int64

Task: Mathematical Operations on Series

1. Addition of two Series
2. Subtraction of two Series
3. Multiplication of two Series
4. Division of two Series

Task : 
Simulate the same approach for a dataframe and you need to cover all the attributes and methods for the dataframe.

In [44]:
series_1 = pd.Series([10, 20, 30, 40, 50], index=['a', 'b', 'c', 'd', 'e'])
series_2 = pd.Series([60, 70, 30, 90,100], index=['a', 'b', 'h', 'i', 'e'])

add_series = series_1 + series_2
print(series_1)
print(add_series)

a    10
b    20
c    30
d    40
e    50
dtype: int64
a     70.0
b     90.0
c      NaN
d      NaN
e    150.0
h      NaN
i      NaN
dtype: float64

In [45]:
sub_series = series_1 - series_2
sub_series

a   -50.0
b   -50.0
c     NaN
d     NaN
e   -50.0
h     NaN
i     NaN
dtype: float64

In [46]:
mul_series = series_1 * series_2
mul_series

a     600.0
b    1400.0
c       NaN
d       NaN
e    5000.0
h       NaN
i       NaN
dtype: float64

In [47]:
divide_series = series_1 / series_2
divide_series

a    0.166667
b    0.285714
c         NaN
d         NaN
e    0.500000
h         NaN
i         NaN
dtype: float64

DataFrame

Read the data

In [50]:
data = pd.read_excel('customers_lyst1748071473851.xlsx')
data.head()

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode
0,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0
1,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN
2,3,Bambi,Westrip,bwestrip2@symantec.com,Female,4057.0,Arkansas,Circle,San Antonio,Texas,78220.0
3,4,Roarke,Pankettman,rpankettman3@wiley.com,Male,74.0,Debs,Point,Memphis,Tennessee,38150.0
4,5,Mikaela,Althorpe,malthorpe4@51.la,NaN,NaN,2nd,Drive,NaN,NaN,83732.0

Summary of the dataframe information

In [51]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 11 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   id             1000 non-null   int64
 1   first_name     1000 non-null   object
 2   last_name      1000 non-null   object
 3   email          878 non-null    object
 4   gender         957 non-null    object
 5   street_num     738 non-null    float64
 6   street_name    963 non-null    object
 7   street_suffix  963 non-null    object
 8   city           921 non-null    object
 9   state          920 non-null    object
 10  postcode       843 non-null    float64
dtypes: float64(2), int64(1), object(8)
memory usage: 86.1+ KB

Add a new column named  as 'Country' and the value inside that is 'USA' in the above dataframe

In [52]:
data['Country'] = 'USA'

In [53]:
data.head()

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,Country
0,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0,USA
1,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN,USA
2,3,Bambi,Westrip,bwestrip2@symantec.com,Female,4057.0,Arkansas,Circle,San Antonio,Texas,78220.0,USA
3,4,Roarke,Pankettman,rpankettman3@wiley.com,Male,74.0,Debs,Point,Memphis,Tennessee,38150.0,USA
4,5,Mikaela,Althorpe,malthorpe4@51.la,NaN,NaN,2nd,Drive,NaN,NaN,83732.0,USA

In [54]:
membership_status = ['Gold', 'Silver', 'Bronze']
data['membership_status'] = membership_status
data.head()

ValueError: Length of values (3) does not match length of index (1000)

Create a new column 'Full Name'  which is composed of firstName and the LastName

In [55]:
data['full_name'] = data['first_name'] + ' ' + data['last_name']
data.head()

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,Country,full_name
0,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0,USA,Romain Southcott
1,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN,USA,Cosimo Molyneaux
2,3,Bambi,Westrip,bwestrip2@symantec.com,Female,4057.0,Arkansas,Circle,San Antonio,Texas,78220.0,USA,Bambi Westrip
3,4,Roarke,Pankettman,rpankettman3@wiley.com,Male,74.0,Debs,Point,Memphis,Tennessee,38150.0,USA,Roarke Pankettman
4,5,Mikaela,Althorpe,malthorpe4@51.la,NaN,NaN,2nd,Drive,NaN,NaN,83732.0,USA,Mikaela Althorpe

Access the rows in a given dataframe: .loc() vs .iloc()

In [56]:
dataframe_demo = {
    'Name' : ['Akash', 'Amir', 'Abhishek', 'Nehal', 'Abhijeet'],
    'Age' : [23, 34, 25, 27, 36],
    'City' : ['Delhi', 'Bengaluru', 'Haryana', 'Noida', 'Pune']
}

dataframe_demo = pd.DataFrame(dataframe_demo, index=['a', 'b', 'c', 'd', 'e'])
dataframe_demo

       Name  Age       City
a     Akash   23      Delhi
b      Amir   34  Bengaluru
c  Abhishek   25    Haryana
d     Nehal   27      Noida
e  Abhijeet   36       Pune

In [57]:
dataframe_demo.loc['b']

Name         Amir
Age            34
City    Bengaluru
Name: b, dtype: object

In [58]:
dataframe_demo.loc['b':'d']

       Name  Age       City
b      Amir   34  Bengaluru
c  Abhishek   25    Haryana
d     Nehal   27      Noida

In [59]:
dataframe_demo.iloc[1]

Name         Amir
Age            34
City    Bengaluru
Name: b, dtype: object

In [63]:
dataframe_demo.iloc[1:4]

       Name  Age       City
b      Amir   34  Bengaluru
c  Abhishek   25    Haryana
d     Nehal   27      Noida

In [64]:
dataframe_demo.loc[0]

KeyError: 0

In [66]:
dataframe_demo_v1 = {
    'Name' : ['Akash', 'Amir', 'Abhishek', 'Nehal', 'Abhijeet'],
    'Age' : [23, 34, 25, 27, 36],
    'City' : ['Delhi', 'Bengaluru', 'Haryana', 'Noida', 'Pune']
}

dataframe_demo_v1 = pd.DataFrame(dataframe_demo_v1)
dataframe_demo_v1

       Name  Age       City
0     Akash   23      Delhi
1      Amir   34  Bengaluru
2  Abhishek   25    Haryana
3     Nehal   27      Noida
4  Abhijeet   36       Pune

In [67]:
dataframe_demo_v1.loc[0]

Name    Akash
Age        23
City    Delhi
Name: 0, dtype: object

In [68]:
dataframe_demo_v1.iloc[0]

Name    Akash
Age        23
City    Delhi
Name: 0, dtype: object

In [69]:
data.head()

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,Country,full_name
0,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0,USA,Romain Southcott
1,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN,USA,Cosimo Molyneaux
2,3,Bambi,Westrip,bwestrip2@symantec.com,Female,4057.0,Arkansas,Circle,San Antonio,Texas,78220.0,USA,Bambi Westrip
3,4,Roarke,Pankettman,rpankettman3@wiley.com,Male,74.0,Debs,Point,Memphis,Tennessee,38150.0,USA,Roarke Pankettman
4,5,Mikaela,Althorpe,malthorpe4@51.la,NaN,NaN,2nd,Drive,NaN,NaN,83732.0,USA,Mikaela Althorpe

In [71]:
data.shape

(1000, 13)

Accesss the details od the id's of the customers from 5000 to 5004

In [75]:
df = data.loc['5000':'5004']
df

Empty DataFrame
Columns: [id, first_name, last_name, email, gender, street_num, street_name, street_suffix, city, state, postcode, Country, full_name]
Index: []

Accesss the details od the id's of the customers from 5000 to 5004

In [83]:
data[(data['id']>= 500) & (data['id'] <= 504)]

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,Country,full_name
499,500,Carolann,Balcock,cbalcockdv@alexa.com,Female,NaN,Stone Corner,Pass,El Paso,Texas,79916.0,USA,Carolann Balcock
500,501,Elliot,Polycote,epolycotedw@infoseek.co.jp,Male,NaN,Prentice,Drive,Hartford,Connecticut,NaN,USA,Elliot Polycote
501,502,Shirline,Halpin,shalpindx@moonfruit.com,NaN,76640.0,Buell,Circle,Dallas,Texas,75216.0,USA,Shirline Halpin
502,503,Darcy,Cruddace,NaN,NaN,NaN,Ridgeview,Court,Utica,New York,13505.0,USA,Darcy Cruddace
503,504,Toiboid,Bentzen,tbentzendz@freewebs.com,Male,913.0,2nd,Trail,White Plains,New York,10606.0,USA,Toiboid Bentzen

In [86]:
data.loc[500:504]

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,Country,full_name
500,501,Elliot,Polycote,epolycotedw@infoseek.co.jp,Male,NaN,Prentice,Drive,Hartford,Connecticut,NaN,USA,Elliot Polycote
501,502,Shirline,Halpin,shalpindx@moonfruit.com,NaN,76640.0,Buell,Circle,Dallas,Texas,75216.0,USA,Shirline Halpin
502,503,Darcy,Cruddace,NaN,NaN,NaN,Ridgeview,Court,Utica,New York,13505.0,USA,Darcy Cruddace
503,504,Toiboid,Bentzen,tbentzendz@freewebs.com,Male,913.0,2nd,Trail,White Plains,New York,10606.0,USA,Toiboid Bentzen
504,505,Paxon,Corris,pcorrise0@behance.net,Male,8362.0,Eliot,Way,Des Moines,Iowa,50362.0,USA,Paxon Corris

In [88]:
data.iloc[500:504]

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,Country,full_name
500,501,Elliot,Polycote,epolycotedw@infoseek.co.jp,Male,NaN,Prentice,Drive,Hartford,Connecticut,NaN,USA,Elliot Polycote
501,502,Shirline,Halpin,shalpindx@moonfruit.com,NaN,76640.0,Buell,Circle,Dallas,Texas,75216.0,USA,Shirline Halpin
502,503,Darcy,Cruddace,NaN,NaN,NaN,Ridgeview,Court,Utica,New York,13505.0,USA,Darcy Cruddace
503,504,Toiboid,Bentzen,tbentzendz@freewebs.com,Male,913.0,2nd,Trail,White Plains,New York,10606.0,USA,Toiboid Bentzen

delete the column

In [90]:
data.drop(columns=['Country'], inplace=True)
data.head()

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,full_name
0,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0,Romain Southcott
1,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN,Cosimo Molyneaux
2,3,Bambi,Westrip,bwestrip2@symantec.com,Female,4057.0,Arkansas,Circle,San Antonio,Texas,78220.0,Bambi Westrip
3,4,Roarke,Pankettman,rpankettman3@wiley.com,Male,74.0,Debs,Point,Memphis,Tennessee,38150.0,Roarke Pankettman
4,5,Mikaela,Althorpe,malthorpe4@51.la,NaN,NaN,2nd,Drive,NaN,NaN,83732.0,Mikaela Althorpe

Rename the roe index with custom index.

'0' - 'firstCustomer'

'1' - 'SecondCustomer'

In [92]:
rename_dict = {
    0: 'firstCustomer',
    1: 'secondCustomer'
}
data.rename(index=rename_dict, inplace=True)
data.head()

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,full_name
firstCustomer,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0,Romain Southcott
secondCustomer,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN,Cosimo Molyneaux
2,3,Bambi,Westrip,bwestrip2@symantec.com,Female,4057.0,Arkansas,Circle,San Antonio,Texas,78220.0,Bambi Westrip
3,4,Roarke,Pankettman,rpankettman3@wiley.com,Male,74.0,Debs,Point,Memphis,Tennessee,38150.0,Roarke Pankettman
4,5,Mikaela,Althorpe,malthorpe4@51.la,NaN,NaN,2nd,Drive,NaN,NaN,83732.0,Mikaela Althorpe

Task - 2 : Can you rename the columns of street_num with the street_number and street_name with the stree_address.

In [104]:
rename_columns_name = {
    'street_num' : 'street_number',
    'street_name' : 'street_address'
}
data.rename(columns=rename_columns_name, inplace=True)
data.head()

,id,first_name,last_name,email,gender,street_number,street_address,street_suffix,city,state,postcode,full_name
firstCustomer,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0,Romain Southcott
secondCustomer,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN,Cosimo Molyneaux
2,3,Bambi,Westrip,bwestrip2@symantec.com,Female,4057.0,Arkansas,Circle,San Antonio,Texas,78220.0,Bambi Westrip
3,4,Roarke,Pankettman,rpankettman3@wiley.com,Male,74.0,Debs,Point,Memphis,Tennessee,38150.0,Roarke Pankettman
4,5,Mikaela,Althorpe,malthorpe4@51.la,NaN,NaN,2nd,Drive,NaN,NaN,83732.0,Mikaela Althorpe

In [97]:
data.loc['firstCustomer':'secondCustomer']

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,full_name
firstCustomer,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0,Romain Southcott
secondCustomer,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN,Cosimo Molyneaux

In [98]:
data.iloc[0:2]

,id,first_name,last_name,email,gender,street_num,street_name,street_suffix,city,state,postcode,full_name
firstCustomer,1,Romain,Southcott,rsouthcott0@clickbank.net,Male,1.0,Trailsway,Road,San Diego,California,92127.0,Romain Southcott
secondCustomer,2,Cosimo,Molyneaux,cmolyneaux1@wiley.com,Male,NaN,NaN,NaN,El Paso,Texas,NaN,Cosimo Molyneaux

Finding the unique values

In [99]:
unique_gender = data['gender'].unique()
print(unique_gender)

['Male' 'Female' nan]

Counts of the unique value in the given column in a dataframe.

Note: It will only return the non-null values as the count

In [105]:
count_unique_gender = data['gender'].nunique()
print(count_unique_gender)

2

In [106]:
data['gender'].value_counts()

gender
Male      485
Female    472
Name: count, dtype: int64